wrk2/results/no_istio_20251230_150048/wrk_logs/wrk_100rps_rep2.log
Running 1m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 79.789ms, rate sampling interval: 511ms
  Thread calibration: mean lat.: 77.107ms, rate sampling interval: 504ms
  Thread calibration: mean lat.: 62.778ms, rate sampling interval: 443ms
  Thread calibration: mean lat.: 65.287ms, rate sampling interval: 479ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    67.72ms  103.23ms 418.56ms   84.36%
    Req/Sec    23.87      6.77    39.00     71.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.52ms
 75.000%  116.29ms
 90.000%  226.82ms
 99.000%  418.56ms
 99.900%  490.75ms
 99.990%  546.30ms
 99.999%  546.30ms
100.000%  546.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.006     0.000000            1         1.00
       2.403     0.100000          196         1.11
       2.805     0.200000          394         1.25
       3.249     0.300000          588         1.43
       4.531     0.400000          783         1.67
       5.519     0.500000          978         2.00
       6.199     0.550000         1076         2.22
       7.575     0.600000         1175         2.50
      36.479     0.650000         1272         2.86
      90.751     0.700000         1370         3.33
     116.287     0.750000         1467         4.00
     130.495     0.775000         1516         4.44
     142.591     0.800000         1565         5.00
     158.719     0.825000         1614         5.71
     177.151     0.850000         1663         6.67
     199.551     0.875000         1712         8.00
     212.991     0.887500         1737         8.89
     227.583     0.900000         1761        10.00
     239.359     0.912500         1785        11.43
     258.943     0.925000         1810        13.33
     272.383     0.937500         1834        16.00
     278.527     0.943750         1847        17.78
     290.559     0.950000         1859        20.00
     304.127     0.956250         1871        22.86
     325.119     0.962500         1883        26.67
     338.943     0.968750         1895        32.00
     346.367     0.971875         1901        35.56
     354.303     0.975000         1908        40.00
     363.007     0.978125         1914        45.71
     378.623     0.981250         1920        53.33
     396.031     0.984375         1926        64.00
     404.223     0.985938         1930        71.11
     407.551     0.987500         1932        80.00
     416.767     0.989062         1935        91.43
     421.631     0.990625         1938       106.67
     426.239     0.992188         1941       128.00
     434.431     0.992969         1943       142.22
     434.687     0.993750         1944       160.00
     449.535     0.994531         1946       182.86
     450.815     0.995313         1947       213.33
     459.775     0.996094         1949       256.00
     461.823     0.996484         1950       284.44
     461.823     0.996875         1950       320.00
     471.295     0.997266         1951       365.71
     474.879     0.997656         1952       426.67
     486.655     0.998047         1953       512.00
     486.655     0.998242         1953       568.89
     486.655     0.998437         1953       640.00
     490.751     0.998633         1954       731.43
     490.751     0.998828         1954       853.33
     503.039     0.999023         1955      1024.00
     503.039     0.999121         1955      1137.78
     503.039     0.999219         1955      1280.00
     503.039     0.999316         1955      1462.86
     503.039     0.999414         1955      1706.67
     546.303     0.999512         1956      2048.00
     546.303     1.000000         1956          inf
#[Mean    =       67.717, StdDeviation   =      103.229]
#[Max     =      545.792, Total count    =         1956]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  2988 requests in 30.03s, 0.97MB read
  Socket errors: connect 0, read 0, write 0, timeout 192
Requests/sec:     99.50  
Transfer/sec:     32.91KB